{
  "backend/main.mo": "Main Motoko actor defining all data types (Product, User, Order, LabTest, HealthPackage, etc.) and backend logic for a health/pharmacy platform, including authorization and blob storage mixins.",
  "backend/migration.mo": "Defines the Actor state shape for migration and a no-op `run` function that passes state through unchanged.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (admin panel, image upload, etc.) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short human-readable summaries describing each file's purpose and notable recent changes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "HTML shell with the page title 'JD Health Lab - Your Health, Delivered' and a root div that mounts the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all application routes (public, admin) and the root layout that handles authentication state, profile setup modal, and prescription upload modal.",
  "frontend/src/components/admin/HealthPackageForm.tsx": "An admin dialog form for creating or editing a HealthPackage, with fields for name, description, prices, sample type, turnaround time, included tests, test parameters, and an image upload.",
  "frontend/src/components/admin/ImageUploadField.tsx": "A reusable form field component that handles image file selection, upload with progress tracking, preview display, and a fallback manual URL input.",
  "frontend/src/components/admin/LabTestForm.tsx": "An admin dialog form for creating or editing a LabTest, with fields for name, description, prices, sample type, turnaround time, test parameters, and an image upload.",
  "frontend/src/components/HealthPackageCard.tsx": "Reusable card component for health packages displaying image, discount badge, included tests, parameters, pricing, and an Add to Cart button backed by CartContext.",
  "frontend/src/components/LabTestBookingModal.tsx": "A modal dialog for booking a lab test, allowing authenticated users to select a date and time slot, then submit the booking via the useBookLabTest mutation with a success confirmation screen.",
  "frontend/src/components/LabTestCard.tsx": "Displays a lab test as a card with image, discount badge, parameters, pricing, and buttons to add to cart or book directly via a callback.",
  "frontend/src/components/Layout.tsx": "Main application layout providing a sticky header with logo, search bar, navigation links, cart icon, and user auth dropdown, plus a mobile bottom navigation bar.",
  "frontend/src/components/LoginButton.tsx": "A reusable button component that handles Internet Identity login and logout, showing a loading spinner during the login process.",
  "frontend/src/components/OrderStatusStepper.tsx": "Renders a horizontal step indicator showing the progression of an order through placed, processing, shipped, and delivered statuses with icons and a progress line.",
  "frontend/src/components/ProductCard.tsx": "Displays a medicine product card with image, discount badge, prescription indicator, star rating, pricing, and an add-to-cart button, linking to the product detail page.",
  "frontend/src/components/ProfileSetupModal.tsx": "A blocking modal dialog that prompts newly authenticated users to enter their name, email, and phone to create their profile before proceeding.",
  "frontend/src/components/UploadPrescriptionModal.tsx": "A modal dialog component that allows users to select and upload a prescription image file for a given order, showing a preview and success state upon completion.",
  "frontend/src/context/CartContext.tsx": "Provides a React context and provider for managing a shopping cart that supports products, lab tests, and health packages, including quantity management and computed totals.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an authenticated or anonymous backend actor using the user's Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useDebounce.ts": "A simple generic hook that debounces a value by a configurable delay, returning the delayed value.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor calls including user profiles, products, articles, lab tests, health packages, orders, prescriptions, and lab bookings.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind directives, and defines a pharmacy-themed CSS variable palette with light/dark mode support and reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Admin panel layout with a collapsible sidebar navigation, authentication and admin-role guards, and an Outlet for nested admin routes. Redirects non-admins or unauthenticated users with appropriate error screens.",
  "frontend/src/pages/admin/HealthPackagesManagement.tsx": "Admin page for managing health packages with a table listing, add/edit form modal, and delete confirmation dialog. Uses React Query mutations for CRUD operations with toast notifications.",
  "frontend/src/pages/admin/LabBookingsManagement.tsx": "Read-only admin page that lists all lab test bookings in a table, showing booking ID, user, test name, appointment time, and creation date. Resolves lab test names by cross-referencing fetched lab test data.",
  "frontend/src/pages/admin/LabTestsManagement.tsx": "Admin page for managing lab tests, providing a table view with add, edit, and delete functionality using React Query mutations and a LabTestForm dialog.",
  "frontend/src/pages/admin/OrdersManagement.tsx": "Admin page that lists all orders in a table with expandable item details and an inline status selector to update each order's fulfillment status.",
  "frontend/src/pages/admin/PrescriptionsManagement.tsx": "Admin page for reviewing uploaded prescriptions, allowing admins to view the prescription image and approve or reject each entry.",
  "frontend/src/pages/ArticleDetail.tsx": "Page component that displays a single health article by ID with a hero image, metadata, full content, and a related articles sidebar.",
  "frontend/src/pages/Articles.tsx": "Page component that lists all health articles in a searchable grid with a featured article highlight and skeleton loading states.",
  "frontend/src/pages/Cart.tsx": "Renders the shopping cart page with item listing, quantity controls, removal, prescription upload prompt for Rx items, and an order summary sidebar with pricing breakdown.",
  "frontend/src/pages/Checkout.tsx": "Multi-step checkout page (address → summary → success) that collects a delivery address, displays order items, and submits the order via the createOrder mutation, requiring user login.",
  "frontend/src/pages/Home.tsx": "Home page featuring an auto-cycling hero carousel, category quick-links, featured product grid, and health articles section, with an optional seed-data action for admins.",
  "frontend/src/pages/LabTests.tsx": "Lab tests and health packages listing page with a search bar, tabbed view between individual tests and packages, and a booking modal triggered per test.",
  "frontend/src/pages/MedicineDetail.tsx": "Product detail page showing image, pricing, discount, ratings, add-to-cart/buy-now actions, and a related products section fetched by category.",
  "frontend/src/pages/MedicineSearch.tsx": "A medicine search page with debounced text search, category filtering, price range slider, prescription filter, and sort options. Displays results using ProductCard components with a responsive filter panel via a Sheet drawer.",
  "frontend/src/pages/OrderHistory.tsx": "Displays a user's order history and lab test bookings in a tabbed layout, with expandable OrderCard components showing status, item thumbnails, and an order status stepper. Requires authentication and shows a login prompt if unauthenticated.",
  "frontend/src/pages/Profile.tsx": "User profile page that shows and allows editing of name, email, and phone fields fetched from the backend, with logout functionality. Redirects unauthenticated users to a login prompt.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read, persist, and clear URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens (using OKLCH), typography, border radius, box shadows, font families, and plugin integrations for the frontend design system.",
  "project_state.json": "Tracks the full project state (version 7) for 'JD Health Lab', a full-stack pharmacy/health web app with React frontend and Node.js/Express backend, detailing existing features, architectural notes, known issues, and image requirements."
}